SimuXAI/blog2/throttle3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          510;
        startFace       4413730;
    }
    outlet
    {
        type            patch;
        nFaces          510;
        startFace       4414240;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          37840;
        startFace       4414750;
    }
    frontBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          57540;
        startFace       4452590;
    }
)

// ************************************************************************* //
